https://zhuanlan.zhihu.com/p/101284491

In [2]:
import pandas as pd
import numpy as np


company=["A","B","C"]

df = pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
}
)

df

  company  salary  age
0       A      33   43
1       C      21   40
2       A      40   32
3       C       7   15
4       C      41   23
5       B      34   15
6       C       7   47
7       A      42   21
8       B      30   41
9       C       5   31

In [9]:
group = df.groupby("company")
print(type(group))
print("*"*10)
group_mean1 = group.agg("mean")
print(group_mean1)
print(type(group_mean1))
print(group_mean1.index)
print(group_mean1.columns)
print("*"*10)
group_mean2 = group.agg(["mean"])
print(group_mean2)
print(type(group_mean2))
print(group_mean2.index)
print(group_mean2.columns)

pandas.core.groupby.generic.DataFrameGroupBy
**********
            salary   age
company
A        38.333333  32.0
B        32.000000  28.0
C        16.200000  31.2
<class 'pandas.core.frame.DataFrame'>
Index(['A', 'B', 'C'], dtype='object', name='company')
Index(['salary', 'age'], dtype='object')
**********
            salary   age
              mean  mean
company
A        38.333333  32.0
B        32.000000  28.0
C        16.200000  31.2
<class 'pandas.core.frame.DataFrame'>
Index(['A', 'B', 'C'], dtype='object', name='company')
MultiIndex([('salary', 'mean'),
            (   'age', 'mean')],
           )

In [19]:
print(group_mean1["salary"])
print(type(group_mean1["salary"]))
print("*"*20)
print((group_mean1[["salary"]]))
print(type((group_mean1[["salary"]])))

company
A    38.333333
B    32.000000
C    16.200000
Name: salary, dtype: float64
<class 'pandas.core.series.Series'>
********************
            salary
company
A        38.333333
B        32.000000
C        16.200000
<class 'pandas.core.frame.DataFrame'>

In [23]:
print(group_mean1["salary"] - group_mean1["age"])
print(group_mean1[["salary"]] - group_mean1[["age"]])

company
A     6.333333
B     4.000000
C   -15.000000
dtype: float64
         age  salary
company
A        NaN     NaN
B        NaN     NaN
C        NaN     NaN